docs/notes/emacs/languages.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Languages</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Programming Languages</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4158001">Haskell</a></li>
<li><a href="#orgaa088d6">Python</a>
<ul>
<li><a href="#orgd31256d">Goals</a></li>
<li><a href="#org2996cb3">Debugging with dap-mode</a></li>
<li><a href="#orgfd77350">Emacs installs pyright automatically</a></li>
<li><a href="#org871dbb7">Questions</a></li>
</ul>
</li>
<li><a href="#orgbbc331f">Bash</a></li>
<li><a href="#orgd52d97b">Deprecated Notes</a>
<ul>
<li><a href="#org5e450f4">PATH</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org4158001" class="outline-2">
<h2 id="org4158001"><a href="#org4158001">Haskell</a></h2>
<div class="outline-text-2" id="text-org4158001">
<p>
The <code>haskell-language-server</code> should be built for the specific GHC version it
will be used with. So, usually you download a bunch of
<code>haskell-language-server</code> binaries, then use <code>haskell-language-server-wrapper</code>
to appropriately choose the right version.
</p>
</div>
</div>

<div id="outline-container-orgaa088d6" class="outline-2">
<h2 id="orgaa088d6"><a href="#orgaa088d6">Python</a></h2>
<div class="outline-text-2" id="text-orgaa088d6">
</div>
<div id="outline-container-orgd31256d" class="outline-3">
<h3 id="orgd31256d"><a href="#orgd31256d">Goals</a></h3>
<div class="outline-text-3" id="text-orgd31256d">
<ul class="org-ul">
<li>Each project has its own virtual environment.</li>
<li>Different projects use different versions of Python.</li>
<li>Each python project can define its own formatting rules. Some projects may
use <code>black</code>, while others use <code>yapf</code>. Each project might define, say,
different maximum line lengths.</li>
<li>Each project can define its own linting rules (using say <code>pylint</code>).</li>
</ul>
</div>
</div>

<div id="outline-container-org2996cb3" class="outline-3">
<h3 id="org2996cb3"><a href="#org2996cb3">Debugging with dap-mode</a></h3>
<div class="outline-text-3" id="text-org2996cb3">
<p>
Install <a href="https://github.com/microsoft/debugpy/">debugpy</a> - how can I install this globally?
</p>
</div>
</div>

<div id="outline-container-orgfd77350" class="outline-3">
<h3 id="orgfd77350"><a href="#orgfd77350">Emacs installs pyright automatically</a></h3>
<div class="outline-text-3" id="text-orgfd77350">
<p>
Emacs ran:
</p>

<div class="org-src-container">
<pre class="src src-sh">/usr/local/bin/npm -g --prefix /Users/chris.clark/emacs/cfclrk/.cache/lsp/npm/pyright install pyright
</pre>
</div>
</div>
</div>

<div id="outline-container-org871dbb7" class="outline-3">
<h3 id="org871dbb7"><a href="#org871dbb7">Questions</a></h3>
<div class="outline-text-3" id="text-org871dbb7">
<p>
Is there a way to conditionally load either the black or yapf lsp plugins
depending on project config?
</p>
</div>
</div>
</div>

<div id="outline-container-orgbbc331f" class="outline-2">
<h2 id="orgbbc331f"><a href="#orgbbc331f">Bash</a></h2>
<div class="outline-text-2" id="text-orgbbc331f">
<p>
Install bash-language-server:
</p>

<div class="org-src-container">
<pre class="src src-sh">yarn global add bash-language-server
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd52d97b" class="outline-2">
<h2 id="orgd52d97b"><a href="#orgd52d97b">Deprecated Notes</a></h2>
<div class="outline-text-2" id="text-orgd52d97b">
<p>
I don't use <code>pyls</code> anymore, I've switched to <code>pyright</code>.
</p>
</div>

<div id="outline-container-org5e450f4" class="outline-3">
<h3 id="org5e450f4"><a href="#org5e450f4">PATH</a></h3>
<div class="outline-text-3" id="text-org5e450f4">
<p>
<code>pyls</code>, <code>pyls-mypy</code>, etc must be on your <code>$PATH</code>. There are a few
ways to accomplish this.
</p>

<ol class="org-ol">
<li>Install <code>pyls</code> (etc) into every virtual environment. Perhaps, add it to
the pyenv default packages list.</li>
<li>Create a pyenv virtual env specifically for <code>pyls</code> etc. Then in each
project, do <code>pyenv local $PROJECTVENV $PYLSVENV</code>. With <code>pyenv</code> you can set
multiple active virtual environments, so always activate the environment
with <code>pyls</code>.</li>
<li><p>
Install <code>pyls</code> etc. somewhere else on your <code>$PATH</code>, and <b>do not</b> install
it into <b>any</b> pyenv virtual environment.
</p>

<p>
I used (2) for a while. Now I'm going with (3). To install it in a
globally-accessible place:
</p>

<div class="org-src-container">
<pre class="src src-sh">/usr/local/opt/python3/libexec/bin/pip install pyls
/usr/local/opt/python3/libexec/bin/pip install pyls-mypy
/usr/local/opt/python3/libexec/bin/pip install pyls-isort
/usr/local/opt/python3/libexec/bin/pip install pyls-black
</pre>
</div>

<p>
Note that if any of <code>pyls</code>, <code>pyls-mypy</code>, etc are installed in <b>any</b> pyenv
virtual environment, things will start going wrong unless you really know
what you're doing. That shouldn't be a problem: no python package should
be requiring <code>pyls</code> or LSP plugins (even as development dependencies).
Different developers use different things, and not everyone uses LSP, so
requiring it would be silly.
</p>

<p>
NOTE: I ALSO NEEDED TO INSTALL mypy and isort into the top-level pip. HOW
CAN I MAKE LSP use the versions of mypy and isort in the virtual environment?
</p>

<div class="org-src-container">
<pre class="src src-sh">/usr/local/opt/python3/libexec/bin/pip install isort
/usr/local/opt/python3/libexec/bin/pip install mypy
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
